app/views/restaurants/show.html.erb

<%= @restaurant.description %><p>
<% @restaurant.reviews.each do |review| %>
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."restaurant_id" = $1  [["restaurant_id", 3]]