app/controllers/restaurants_controller.rb

  def create
    @restaurant = Restaurant.new(restaurant_params)
    if @restaurant.save
---
INSERT INTO "restaurants" ("name", "rating", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Macey's Meatballs"], ["rating", 5], ["created_at", "2016-05-26 10:23:46.981102"], ["updated_at", "2016-05-26 10:23:46.981102"]]

  def update
    @restaurant = Restaurant.find(params[:id])
    @restaurant.update(restaurant_params)
---
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT 1  [["id", 4]]
UPDATE "restaurants" SET "name" = $1, "rating" = $2, "description" = $3, "updated_at" = $4 WHERE "restaurants"."id" = $5  [["name", "not cool"], ["rating", 3], ["description", "hfdiosa"], ["updated_at", "2016-05-27 11:00:12.096101"], ["id", 1]]

  def destroy
    @restaurant = Restaurant.find(params[:id])
    @restaurant.destroy
---
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT 1  [["id", 9]]
DELETE FROM "restaurants" WHERE "restaurants"."id" = $1  [["id", 9]]