app/controllers/reviews_controller.rb

SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT 1  [["id", 26]]
---
  def new
    @restaurant = Restaurant.find(params[:restaurant_id])